================
Raw Text Expression
================
<script context="module">
    let name = 'world';
</script>
<h1>Hello {name'<>{}``"\''""``{}}!</h1>
----

(document
    (script_element
        (start_tag (tag_name)
            (attribute (attribute_name) (quoted_attribute_value (attribute_value))))
        (raw_text)
        (end_tag (tag_name)))
    (text)
    (element
        (start_tag (tag_name))
        (text)
        (expression (raw_text_expr))
        (text)
        (end_tag (tag_name)))
)

==============
Dynamic Expression Attribute
==============
<img src={src} alt="A man dances">
<Info {...pkg} />
----
(document
    (element
        (start_tag (tag_name)
            (attribute (attribute_name) (expr_attribute_value (expression (raw_text_expr))))
            (attribute (attribute_name) (quoted_attribute_value (attribute_value)))
        )
        
    )
    (element
        (self_closing_tag
            (tag_name)
            (attribute (attribute_name (raw_text_expr)))
        )
    )
)

===============
logical_blocks
===============
{#if user.loggedIn}hello
	<button on:click={toggle}>logged in</button>
{:else if hello}
    <li></li> 
{:else}
{/if}
{hello}
{#each cats as cat}
    <li></li>
{/each}

{ thenRandomExpr }
{ @html '<p>hello world</p>'}
{{}}
-------
(document
    (if_statement
        (if_start_expr (raw_text_expr))
        (text)
        (element
            (start_tag
                (tag_name)
                (attribute (attribute_name)
                    (expr_attribute_value
                        (expression (raw_text_expr))
                    )
                )
            )
            (text)
            (end_tag (tag_name))
        )
        (text)
        (else_if_statement
            (else_if_expr (raw_text_expr)) (text)
            (element
                (start_tag (tag_name))
                (end_tag (tag_name))
            ) (text) 
            (else_statement (else_expr) (text)
                (if_end_expr) 
            )
        )
    ) (text)
    (expression (raw_text_expr)) (text)
    (each_statement
        (each_start_expr (raw_text_each) (as) (raw_text_expr)) (text)
        (element (start_tag (tag_name)) (end_tag (tag_name))) (text)
        (each_end_expr)
    ) (text)
    (expression (raw_text_expr)) (text)
    (html_expr (raw_text_expr)) (text)
    (expression (raw_text_expr))
)

=======================
await
========================
{#await promise}
{:then number}
{:catch error}
{/await}

{#await promise then value}
    <p></p>
{/await}
{#await yo thenvalue}
{/await}
------
(document
    (await_statement
        (await_start_expr (raw_text_expr)) (text)
        (then_statement (then_expr (raw_text_expr)) (text)
            (catch_statement (catch_expr (raw_text_expr)) (text)
                (await_end_expr)
            )
        )
    )
    (text)
    (await_statement
        (await_start_expr (raw_text_await) (then) (raw_text_expr)) (text)
        (element (start_tag (tag_name)) (end_tag (tag_name))) (text)
        (await_end_expr)
    ) (text)
    (await_statement
        (await_start_expr (raw_text_expr)) (text)
        (await_end_expr)
    )
)

====================
Special elements
=====================
<svelte:head>
    <link rel="stylesheet" href="tutorial/dark-theme.css"/>
</svelte:head>
<svelte:options immutable={true} />
----
(document
    (element
        (start_tag (tag_name))
        (text)
        (element
            (self_closing_tag (tag_name)
                (attribute (attribute_name) (quoted_attribute_value (attribute_value)))
                (attribute (attribute_name) (quoted_attribute_value (attribute_value)))
            )
        )
        (text)
        (end_tag (tag_name))
    )
    (text)
    (element
        (self_closing_tag (tag_name)
            (attribute (attribute_name)
                (expr_attribute_value (expression (raw_text_expr)))
            )
        )
    )
)

========================
if-else-nested
========================
{#if something}
    text
{:else if someOtherThing}
    text2
  {#if something}
    text3
  {:elseif someOtherThing}
    text4
  {:else}
    text5
  {/if}
{:else}
    text6
{/if}
---
(document
    (if_statement (if_start_expr (raw_text_expr)) (text)
        (else_if_statement (else_if_expr (raw_text_expr)) (text)
            (if_statement (if_start_expr (raw_text_expr)) (text)
                (else_if_statement
                    (else_if_expr (raw_text_expr)) (text)
                    (else_statement (else_expr) (text) (if_end_expr)
                    )  
                )
            ) (text)
            (else_statement (else_expr) (text)
                (if_end_expr)
            )
        )
    )
)

